In [7]:
import numpy as np
import pandas as pd

df = pd.read_csv('archive/basic1.csv')

df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [8]:
df.isnull().sum()

id       0
age      0
city     0
f1      31
f2       0
f3      95
f4       0
f5       0
dtype: int64

In [9]:
df.shape

(100, 8)

In [10]:
df.isnull().sum()/df.shape[0]

id      0.00
age     0.00
city    0.00
f1      0.31
f2      0.00
f3      0.95
f4      0.00
f5      0.00
dtype: float64

In [11]:
print(f'삭제 전 : {df.shape}')

df = df.drop(['f3'], axis=1)

print(f'삭제 후 : {df.shape}')

삭제 전 : (100, 8)
삭제 후 : (100, 7)

In [12]:
df['city'].unique()

array(['서울', '부산', '대구', '경기'], dtype=object)

In [13]:
s = df[df['city'] == '서울']['f1'].median()
b = df[df['city'] == '부산']['f1'].median()
g = df[df['city'] == '경기']['f1'].median()
d = df[df['city'] == '대구']['f1'].median()

In [14]:
s,b,g,d

(68.0, 62.0, 58.0, 75.0)

In [15]:
df[18:21]

      id   age city    f1  f2    f4         f5
18  id19  53.0   서울   NaN   0  ISFP  83.685380
19  id20  11.0   서울  51.0   1  INTJ  91.297791
20  id21  90.0   부산   NaN   1  ISFP  29.269869

In [16]:
df['f1'] = df['f1'].fillna(df['city'].map({'서울' :s, '경기' : g, '부산' :b, '대구' : d}))

df[18:21]

      id   age city    f1  f2    f4         f5
18  id19  53.0   서울  68.0   0  ISFP  83.685380
19  id20  11.0   서울  51.0   1  INTJ  91.297791
20  id21  90.0   부산  62.0   1  ISFP  29.269869

In [17]:
print(df['f1'].mean())

65.52